In [252]:
pwd

'/Users/mailysjaffret/Desktop/IRONHACK/vanguard_ab_test_week5_project/Notebooks/Ma√Ølys'

In [253]:
import pandas as pd

df1 = pd.read_csv('../../data/raw/df_final_demo.txt')
df1.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [254]:
df1.shape

(70609, 9)

In [255]:
df1.rename(columns= {'clnt_tenure_yr': 'tenure_year', 'clnt_tenure_mnth': 'tenure_month', 'clnt_age': 'age',
                     'gendr': 'gender', 'num_accts': 'number_of_accounts', 'bal': 'balance'}, inplace=True)

In [317]:
df1.head()

,client_id,tenure_year,tenure_month,age,gender,number_of_accounts,balance,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [319]:
df1['gender'].unique

<bound method Series.unique of 0        U
1        U
2        U
3        M
4        F
        ..
70604    U
70605    M
70606    F
70607    M
70608    F
Name: gender, Length: 70609, dtype: object>

In [323]:
df1.gender.unique()

array(['U', 'M', 'F', nan, 'X'], dtype=object)

In [325]:
df1['gender'].describe()

count     70595
unique        4
top           U
freq      24122
Name: gender, dtype: object

In [258]:
df1.dtypes

client_id               int64
tenure_year           float64
tenure_month          float64
age                   float64
gender                 object
number_of_accounts    float64
balance               float64
calls_6_mnth          float64
logons_6_mnth         float64
dtype: object

In [259]:
df1.isnull().sum()

client_id              0
tenure_year           14
tenure_month          14
age                   15
gender                14
number_of_accounts    14
balance               14
calls_6_mnth          14
logons_6_mnth         14
dtype: int64

In [260]:
df2 = pd.read_csv('../../data/raw/df_final_experiment_clients.txt')
df2.head()

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

In [261]:
df2.dtypes

client_id     int64
Variation    object
dtype: object

In [262]:
df2.shape

(70609, 2)

In [263]:
df2.isnull().sum()

client_id        0
Variation    20109
dtype: int64

In [264]:
df2 = df2.dropna(axis=0)
df2.shape

(50500, 2)

In [265]:
df3 = pd.read_csv('../../data/raw/df_final_web_data_pt_1.txt')
df3.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [266]:
df3.shape

(343141, 5)

In [267]:
df3.isnull().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [268]:
df3.duplicated().sum()

2095

In [269]:
df3 = df3.drop_duplicates()
df3.shape

(341046, 5)

In [270]:
df3.dtypes

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [271]:
df3['date_time'] = pd.to_datetime(df3['date_time'])
df3.dtypes

client_id                int64
visitor_id              object
visit_id                object
process_step            object
date_time       datetime64[ns]
dtype: object

In [272]:
df4 = pd.read_csv('../../data/raw/df_final_web_data_pt_2.txt')
df4.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

In [273]:
df4.shape

(412264, 5)

In [274]:
df4.isnull().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [275]:
df4.duplicated().sum()

8669

In [276]:
df4 = df4.drop_duplicates()

In [277]:
df4.shape

(403595, 5)

In [278]:
df4.dtypes

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [279]:
df4['date_time'] = pd.to_datetime(df4['date_time'])

In [280]:
df4.dtypes

client_id                int64
visitor_id              object
visit_id                object
process_step            object
date_time       datetime64[ns]
dtype: object

In [281]:
df4.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

In [282]:
df5 = pd.concat([df3, df4], axis=0)

In [283]:
df5.shape

(744641, 5)